### Pandas Functions and Attributes

In [1]:
import pandas as pd
dict={'Name':['Smith','John','Vivian','Mutu','Ashof','Parasad','Kumar'], 
     'Marks':[98,89,99,87,90,80,82]}
df=pd.DataFrame(dict,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])
df

         Name  Marks
stu1    Smith     98
stu2     John     89
stu3   Vivian     99
stu4     Mutu     87
stu5    Ashof     90
stu6  Parasad     80
stu7    Kumar     82

### shape

In [2]:
#total number of columns and rows
df.shape

(7, 2)

In [3]:
#assign to the variables a nd b
a,b=df.shape
print(a,b)

7 2

In [4]:
#print first 5 rows
df.head()

        Name  Marks
stu1   Smith     98
stu2    John     89
stu3  Vivian     99
stu4    Mutu     87
stu5   Ashof     90

In [6]:
#print last 5 rows
df.tail()

         Name  Marks
stu3   Vivian     99
stu4     Mutu     87
stu5    Ashof     90
stu6  Parasad     80
stu7    Kumar     82

In [7]:
#print column labels of data frame
df.columns

Index(['Name', 'Marks'], dtype='object')

In [8]:
# print information if data frame
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, stu1 to stu7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
dtypes: int64(1), object(1)
memory usage: 168.0+ bytes

In [9]:
df

         Name  Marks
stu1    Smith     98
stu2     John     89
stu3   Vivian     99
stu4     Mutu     87
stu5    Ashof     90
stu6  Parasad     80
stu7    Kumar     82

In [11]:
# display as series
df.Name

stu1      Smith
stu2       John
stu3     Vivian
stu4       Mutu
stu5      Ashof
stu6    Parasad
stu7      Kumar
Name: Name, dtype: object

In [12]:
df['Name']

stu1      Smith
stu2       John
stu3     Vivian
stu4       Mutu
stu5      Ashof
stu6    Parasad
stu7      Kumar
Name: Name, dtype: object

In [13]:
# display as data frame
df[['Name']]

         Name
stu1    Smith
stu2     John
stu3   Vivian
stu4     Mutu
stu5    Ashof
stu6  Parasad
stu7    Kumar

In [15]:
df[['Name','Marks']]

         Name  Marks
stu1    Smith     98
stu2     John     89
stu3   Vivian     99
stu4     Mutu     87
stu5    Ashof     90
stu6  Parasad     80
stu7    Kumar     82

- min()
- max()
- mean()
- describe()

In [18]:
df['Marks'].min()

80

In [19]:
df['Marks'].max()

99

In [20]:
df['Marks'].mean()

89.28571428571429

In [22]:
# print stastical information of data frame
df.describe()

           Marks
count   7.000000
mean   89.285714
std     7.250616
min    80.000000
25%    84.500000
50%    89.000000
75%    94.000000
max    99.000000

In [23]:
df['Marks'].value_counts()

98    1
89    1
99    1
87    1
90    1
80    1
82    1
Name: Marks, dtype: int64

In [30]:
import pandas as pd
dict={'Student Name':['Smith','John','Vivian','Mutu','Ashof','Parasad','Kumar'], 
     'Marks':[98,87,98,87,90,89,98]}
df=pd.DataFrame(dict,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])
df

     Student Name  Marks
stu1        Smith     98
stu2         John     87
stu3       Vivian     98
stu4         Mutu     87
stu5        Ashof     90
stu6      Parasad     89
stu7        Kumar     98

In [31]:
#print very frequent value in data frame
df['Marks'].value_counts()

98    3
87    2
90    1
89    1
Name: Marks, dtype: int64

In [32]:
#print total number of non null value
df['Marks'].count()

7

#### * Better use Bracket notation .[ ], 
#### ***do not use dot ( . ) notation

In [33]:
df.Student Name

SyntaxError: invalid syntax (748300661.py, line 1)

In [34]:
df['Student Name']

stu1      Smith
stu2       John
stu3     Vivian
stu4       Mutu
stu5      Ashof
stu6    Parasad
stu7      Kumar
Name: Student Name, dtype: object